test_inlet3/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 5e-5;

boundaryField
{
	// LeftandRight
	// {
	// 	type epsilonWallFunction;
	// 	value $internalField;
	// }

	// frontAndBack
	// {
	
	// 	type epsilonWallFunction;
	// 	value $internalField;
	// }


    frontAndBack
    {
        type            empty;
    }

    leftAndRight
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    hot
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    cold
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    
    outlet
    {
        type            zeroGradient;
    }
	Baffle
	{
	
		type epsilonWallFunction;
		value $internalField;
	}

}


// ************************************************************************* //
